src/cf/Catalogs/УзлыКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УзлыКОД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРежимеВосстановления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраницаАктуальностиДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецИнтервалаВосстановления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоИнтервалаВосстановления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправлятьДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПолучатьДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПриложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервисов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксШтрихкода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПриложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверСервисов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаПриложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаСервисов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияКОД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровеньИсторииКОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияПотоковКОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПотока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДатаВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИмяСообщенияКОД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/НаправленияПотоковКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияПотоковКОД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/УзлыКОД/Forms/ТрафикПоУзлам/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДата = НачалоДня(ТекущаяУниверсальнаяДата());
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФайлы(ТекУзелКОД, ТаблЗнач, НовСтр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ИсторияКОД.Размер), 0) КАК Размер
		|ИЗ
		|	РегистрСведений.ИсторияКОД КАК ИсторияКОД
		|ГДЕ
		|	ИсторияКОД.Направление = &Направление
		|	И ИсторияКОД.УниверсальнаяДатаВМиллисекундах МЕЖДУ &УниверсальнаяДатаВМиллисекундахНач И &УниверсальнаяДатаВМиллисекундахКон
		|	И ИсторияКОД.Узел = &Узел";
	
	Запрос.УстановитьПараметр("Узел", ТекУзелКОД);
	
	УниверсальнаяДатаВМиллисекундахНач = ОбщегоНазначенияДокументооборот.ДатаВМиллисекундах(НачалоДня(ТекДата));
	УниверсальнаяДатаВМиллисекундахКон = ОбщегоНазначенияДокументооборот.ДатаВМиллисекундах(КонецДня(ТекДата));
	
	Запрос.УстановитьПараметр("УниверсальнаяДатаВМиллисекундахНач", УниверсальнаяДатаВМиллисекундахНач);
	Запрос.УстановитьПараметр("УниверсальнаяДатаВМиллисекундахКон", УниверсальнаяДатаВМиллисекундахКон);
	Запрос.УстановитьПараметр("Направление", Перечисления.НаправленияПотоковКОД.Отправка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	РазмерОтправка = Выборка.Размер;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ИсторияКОД.Размер), 0) КАК Размер
		|ИЗ
		|	РегистрСведений.ИсторияКОД КАК ИсторияКОД
		|ГДЕ
		|	ИсторияКОД.Направление = &Направление
		|	И ИсторияКОД.УниверсальнаяДатаВМиллисекундах МЕЖДУ &УниверсальнаяДатаВМиллисекундахНач И &УниверсальнаяДатаВМиллисекундахКон
		|	И ИсторияКОД.Узел = &Узел";
	
	Запрос.УстановитьПараметр("Узел", ТекУзелКОД);
	
	Запрос.УстановитьПараметр("УниверсальнаяДатаВМиллисекундахНач", УниверсальнаяДатаВМиллисекундахНач);
	Запрос.УстановитьПараметр("УниверсальнаяДатаВМиллисекундахКон", УниверсальнаяДатаВМиллисекундахКон);
		
	Запрос.УстановитьПараметр("Направление", Перечисления.НаправленияПотоковКОД.Получение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	РазмерПриемка = Выборка.Размер;
	
	НовСтр = ТаблЗнач.Добавить();
	НовСтр.РазмерПринято = РазмерПриемка;
	НовСтр.РазмерПринятоСтрока = РаботаСоСтроками.ПолучитьРазмерСтрокой(РазмерПриемка);
	НовСтр.РазмерОтправлено = РазмерОтправка;
	НовСтр.РазмерОтправленоСтрока = РаботаСоСтроками.ПолучитьРазмерСтрокой(РазмерОтправка);
	НовСтр.Узел = ТекУзелКОД;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	ЭтотУзел = Справочники.УзлыКОД.ЭтотУзел;
	
	ТаблЗнач = РеквизитФормыВЗначение("ТаблицаФайлы");
	ТаблЗнач.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УзлыКОД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УзлыКОД КАК УзлыКОД
		|ГДЕ
		|	УзлыКОД.ПометкаУдаления = ЛОЖЬ
		|	И УзлыКОД.НеОтправлятьДанные = ЛОЖЬ
		|	И УзлыКОД.НеПолучатьДанные = ЛОЖЬ
		|	И УзлыКОД.Ссылка <> &ТекСсылка";
	
	Запрос.УстановитьПараметр("ТекСсылка", ЭтотУзел);
	
	МассивУзловКОД = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Для Каждого УзелПлана Из МассивУзловКОД Цикл
		
		НовСтр = Неопределено;
		ЗаполнитьФайлы(УзелПлана, ТаблЗнач, НовСтр);
		
	КонецЦикла;	
	
	РазмерФайловОтправлено = 0;
	РазмерФайловПринято = 0;
	
	Для Каждого Стр Из ТаблЗнач Цикл
		
		РазмерФайловПринято = РазмерФайловПринято + Стр.РазмерПринято;
		РазмерФайловОтправлено = РазмерФайловОтправлено + Стр.РазмерОтправлено;
		
	КонецЦикла;	
	ИтогРазмерПринято = РаботаСоСтроками.ПолучитьРазмерСтрокой(РазмерФайловПринято);
	ИтогРазмерОтправлено = РаботаСоСтроками.ПолучитьРазмерСтрокой(РазмерФайловОтправлено);
	
	ТаблЗнач.Сортировать("Узел");
	ЗначениеВРеквизитФормы(ТаблЗнач, "ТаблицаФайлы");
	
	
	// Заполняем гистограмму
	Диаграмма.Обновление = Ложь;
	
	Диаграмма.АвтоМаксимальноеЗначение	= Ложь;
	Диаграмма.АвтоМинимальноеЗначение	= Ложь;
	Диаграмма.МаксимальноеЗначение		= 1;
	Диаграмма.МинимальноеЗначение		= 0;
	Диаграмма.БазовоеЗначение			= 0;
	Диаграмма.ПропускатьБазовоеЗначение	= Истина;
	
	Диаграмма.Очистить();
	Элементы.Диаграмма.Заголовок = НСтр("ru= 'Трафик обмена (Мб) по узлам'");
	
	Серия = Диаграмма.Серии.Добавить(НСтр("ru= 'Получено'"));
	Серия.Текст = НСтр("ru= 'Получено'");
	Серия.Цвет = WebЦвета.Древесный;
	
	Серия = Диаграмма.Серии.Добавить(НСтр("ru= 'Отправлено'"));
	Серия.Текст = НСтр("ru= 'Отправлено'");
	Серия.Цвет = WebЦвета.БледноСиреневый;
	
	ЕстьДанные = Ложь;
	
	Для Каждого Строка Из ТаблЗнач Цикл
		
		ЕстьДанные = Истина;
	
		Точка = Диаграмма.Точки.Добавить(НСтр("ru= 'Данные'"));
		Точка.Текст = Строка.Узел;
		Точка.Значение = Строка.Узел;
		
		Для Каждого Серия Из Диаграмма.Серии Цикл
			
			Если Серия.Текст = НСтр("ru= 'Получено'") Тогда
				// тут размер полученного
				ЗначениеТочки = ФайловыеФункцииКлиентСервер.ПолучитьСтрокуСРазмеромФайла(
					Строка.РазмерПринято / (1024 * 1024));
				Диаграмма.УстановитьЗначение(Точка, Серия, ЗначениеТочки, , 
					НСтр("ru= 'Получено'"));
			КонецЕсли;	
			
			Если Серия.Текст = НСтр("ru= 'Отправлено'") Тогда
				// тут размер отправленного
				ЗначениеТочки = ФайловыеФункцииКлиентСервер.ПолучитьСтрокуСРазмеромФайла(
					(Строка.РазмерОтправлено) / (1024 * 1024));
				Диаграмма.УстановитьЗначение(Точка, Серия, ЗначениеТочки, , 
					НСтр("ru= 'Отправлено'"));
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Диаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	Диаграмма.ПоложениеПодписей = ПоложениеПодписейКДиаграмме.КрайВнутри;
	Диаграмма.ОтображатьЛегенду = Истина;
	
	Диаграмма.ВидПодписей = ВидПодписейКДиаграмме.Значение;
	
	Диаграмма.Обновление = Истина;
	
	
КонецПроцедуры
